Repository: nimmalapalli/evurbo
Catalog: src/locale/messages.*.xlf
Languages: te

source: Choose Evurbo for seamless electric bike rentals
te: అంతరాయం లేని ఎలక్ట్రిక్ బైక్ అద్దెల కోసం ఎవుర్బోను ఎంచుకోండి

source: Mobile Number
te: మొబైల్ నెంబరు

source: Mobile Number is required
te: మొబైల్ నెంబరు అవసరం అవుతుంది

source: Invalid Mobile Number
te: చెల్లని మొబైల్ నెంబరు

source: First Name
te: మొదటి పేరు

source: First Name is required
te: మొదటి పేరు అవసరం అవుతుంది

source: Last Name
te: చివరి పేరు

source: Last Name is required
te: చివరి పేరు అవసరం అవుతుంది

source: Date of Birth
te: పుట్టిన తేది

source: Date of Birth is required
te: పుట్టిన తేదీ అవసరం అవుతుంది

source: You must be at least 18 years old.
te: కనీసం 18 ఏళ్లు నిండి ఉండాలి.

source: Email
te: ఇమెయిల్

source: Email is required
te: ఇమెయిల్ అవసరం అవుతుంది

source: Invalid Email Address
te: చెల్లని ఇమెయిల్ చిరునామా

source: License Number
te: లైసెన్స్ నెంబరు

source: License Number is required
te: లైసెన్స్ నెంబరు అవసరం అవుతుంది

source: Invalid License Number
te: చెల్లని లైసెన్స్ నెంబరు

source: License Number cannot exceed 16 characters
te: లైసెన్స్ నెంబరు 16 అక్షరాలను మించరాదు

source: License Number must be at least 16 character long
te: లైసెన్స్ నెంబరు కనీసం 16 అక్షరాల పొడవు ఉండాలి

source: Gender
te: లింగము

source: Gender is required
te: లింగం అవసరం

source: Select Hub
te: హబ్ ను ఎంచుకోండి

source: Hub selection is required
te: హబ్ ఎంపిక అవసరం అవుతుంది

source: Select Model
te: మోడల్ ఎంచుకోండి

source: Model selection is required
te: మోడల్ ఎంపిక అవసరం అవుతుంది

source: Start Date
te: ప్రారంభ తేదీ

source: Start Date is required
te: ప్రారంభ తేదీ అవసరం

source: Start Time
te: ప్రారంభ సమయం

source: End Date
te: ముగింపు తేదీ

source: End Date is required
te: ముగింపు తేదీ అవసరం

source: Start Date must be before End Date
te: ప్రారంభ తేదీ ముగింపు తేదీకి ముందు ఉండాలి

source: End Time
te: ముగింపు సమయం

source: Total Amount
te: మొత్తం మొత్తం

source: I accept the <a href="https://evurbo.energy/terms-and-conditions/" target="_blank">Terms and Conditions</a>
te: నేను అంగీకరిస్తున్నాను నిబంధనలు మరియు షరతులు

source: You must accept the Terms and Conditions to proceed.
te: ముందుకు సాగడం కొరకు మీరు నిబంధనలు మరియు షరతులను తప్పనిసరిగా అంగీకరించాలి.

source: Proceed
te: నడచు

source: Experience the convenience and eco-friendly charm of exploring the city on our rental ebikes.
te: మా అద్దె ఎబైక్ లలో నగరాన్ని అన్వేషించడం యొక్క సౌలభ్యం మరియు పర్యావరణ అనుకూల ఆకర్షణను అనుభవించండి.

source: Visit Our website <a href="https://evurbo.energy/" target="_blank">EVURBO</a>
te: మా వెబ్ సైట్ సందర్శించండి EVURBO
